#!/usr/bin/env bash
##############################################################################
# Function：同盾企业级软件-操作系统调优工具
# Parameters：无
# Author： rong.li
# Date：2023-08-18
##############################################################################
############### 参数配置区
# TODO 待编写

############################## 操作配置区end ###################################
# CUR_PATH：当前执行命令所在路径，BIN_DIR：被执行脚本所在路径
exe_cmd=$0
CUR_PATH=`pwd`
relative_dir=`dirname ${exe_cmd}`
cd $relative_dir
BIN_DIR=`pwd`
cd $CUR_PATH
##############################################################################
# 导入全局公共脚本
. $BIN_DIR/common_function.sh
. $BIN_DIR/config.ini
##############################################################################
